The  IndexStreamLine  type exposes the following members.
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  IndexStream  .)
 See Also
  IndexStreamLine Class
  Autodesk.Revit.DB.DirectContext3D Namespace